cases/schneider_validation/system/controlDict_Velocity
FoamFile 
     { 
version   2.0;
format ascii;
 class dictionary;
object controlDict;
     } 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

application simpleFoam; startFrom latestTime; startTime latestTime; stopAt endTime; endTime 1; deltaT 1e-6; writeControl adjustableRunTime; writeInterval 1e-2; 
purgeWrite 0;writeFormat ascii; writePrecision 6; writeCompression uncompressed; timeFormat general; timePrecision 6; runTimeModifiable yes; adjustTimeStep  yes; 
maxCo 0.8; maxAlphaCo 0.8; maxDeltaT 1; 
