cases/schneider_validation/system/controlDict_electrochem
FoamFile 
     { 
version   2.0;
format ascii;
 class dictionary;
object controlDict;
     } 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

application electrolyisConcFoam3; startFrom latestTime; startTime latestTime; stopAt endTime; endTime 1000; deltaT 1e-6; writeControl adjustableRunTime; writeInterval 1000; 
purgeWrite 0;writeFormat ascii; writePrecision 6; writeCompression uncompressed; timeFormat general; timePrecision 6; runTimeModifiable yes; adjustTimeStep  yes; 
maxCo 0.4; maxAlphaCo 0.4; maxDeltaT 1; 
