cases/schneider_validation/system/controlDict_flow
FoamFile 
     { 
version   2.0;
format ascii;
 class dictionary;
object controlDict;
     } 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

application     pemfcPorousFlowFoam;
startFrom       latestTime;
startTime       latestTime;
stopAt          endTime;
endTime         200;
deltaT          1;
writeControl    timeStep;
writeInterval   200;
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression uncompressed;
timeFormat      general;
timePrecision   8;
runTimeModifiable yes;
adjustTimeStep  no;
