cases/schneider_validation/constant/appliedCurrent
inputValue 0.09604;
