cases/schneider_validation/constant/controlProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// control variables
#include "appliedCurrent"
#include "OFdata.txt"

control	3; //1- potentiostatic mode 2- fixed cell potential 3- galvanostatic mode

alpha	1.3; //0.3; //1.3; //1.3; //under-over relaxation parameter (recomended values are 0.3 for mode 1, 1 for mode 2 and 1.3 for mode 3)

maxPot	6; // max cell potential you expect (when control = 1 or 3) or cell potential (when control = 2)

// When control == 1

//ref 1.208; //2 //0.1 set potential vs reference (when control = 1) // <0 for cathodic processes >0 for anodic ones
ref 0.5;

tol_ref	0.002; //set tolerance for finding the Vcell and Icell for a given ref potential

maxvar	0.05; //maximal variability of Vcell (when control = 1)

refLocation (0.05 0.01 0.075); //position of ref electrode (x y z)

// When control == 3 (now amended to choose current density instead of current)

I	$inputValue; //20;// //total current (when control = 3)

//I       #eval{$inputValue * $cellCrossArea}; // define the current
//I	1e-4; //20;// //total current (when control = 3)

tol_I	0.002; // tolerance to the desire current
tol_I	0.002; // tolerance to the desire current

relaxationFactor 0.3;

// ************************************************************************* //

// Schneider et al. single-channel validation control
operatingMode potentiostatic;
VcellSetpoint 0.6;
initialCurrent 0.0608;
potentiostaticCurrentTolerance 1e-7;

