cases/schneider_validation/0/fi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      fi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//dimensions      [1 2 -3 0 0 -1 0];
dimensions      [0 0 0 0 0 0 0];

//#include "BCinput"
#include "../constant/appliedCurrent"

internalField   uniform 0;

boundaryField
{


".*"
{
type zeroGradient;
}

}


// ************************************************************************* //
