cases/schneider_validation/system/topoSetDict
FoamFile { version 2.0; format ascii; class dictionary; object topoSetDict; }
actions
(
    { name channelInletFaces; type faceSet; action new; source patchToFace; patch inlet; }
    { name channelInletFaces; type faceSet; action subset; source boxToFace; box (-0.00101 -0.00401 0.00027) (0.00101 -0.00399 0.00129); }
    { name channelOutletFaces; type faceSet; action new; source patchToFace; patch outlet; }
    { name channelOutletFaces; type faceSet; action subset; source boxToFace; box (-0.00101 0.00399 0.00027) (0.00101 0.00401 0.00129); }
    { name catalystFaces; type faceSet; action new; source patchToFace; patch fluid; }
    { name catalystFaces; type faceSet; action subtract; source normalToFace; normal (1 0 0); cos 0.01; }
    { name catalystFaces; type faceSet; action subtract; source normalToFace; normal (-1 0 0); cos 0.01; }
    { name catalystFaces; type faceSet; action subtract; source normalToFace; normal (0 1 0); cos 0.01; }
    { name catalystFaces; type faceSet; action subtract; source normalToFace; normal (0 -1 0); cos 0.01; }
    { name catalystFaces; type faceSet; action subtract; source normalToFace; normal (0 0 1); cos 0.01; }
);
